In [328]:
import pandas as pd
path2 = r"‪‪C:\Users\v099452\Data-XLS.xlsx"
clean_path = path2.encode("ascii", "ignore").decode()
df = pd.read_excel(clean_path)
df.head()
#print(set(df['EMPL_ID']))

,BATCH_SEQ_NUMBER,BATCH_ITERATION_SEQ,EMPL_ID,START_DATE,EXPIRE_DATE,SCHED_TYPE,INTERVAL_TYPE,SCHED_DAY,START_TIME,END_TIME,CYCLE_START_DATE,SHIFT_IND,ROW_INDEX,PROCESS_FLAG,INVALID_DATA,COMMENTS,CREATED_DATETIME
0,9,1,8574,2025-06-29,2026-06-29,WEEK,SW,1,1990-01-01 07:30:00,1990-01-01 11:30:00,2025-06-29,D,1,0,1,Migration date greater than start date.,2025-11-07 10:17:20
1,9,1,8574,2025-06-29,2026-06-29,WEEK,SW,1,1990-01-01 11:30:00,1990-01-01 12:00:00,2025-06-29,D,2,0,1,Migration date greater than start date.,2025-11-07 10:17:20
2,9,1,8574,2025-06-29,2026-06-29,WEEK,SW,1,1990-01-01 12:00:00,1990-01-01 16:00:00,2025-06-29,D,3,0,1,Migration date greater than start date.,2025-11-07 10:17:20
3,9,1,8574,2025-06-29,2026-06-29,WEEK,SW,2,1990-01-01 07:30:00,1990-01-01 11:30:00,2025-06-29,D,4,0,1,Migration date greater than start date.,2025-11-07 10:17:20
4,9,1,8574,2025-06-29,2026-06-29,WEEK,SW,2,1990-01-01 11:30:00,1990-01-01 12:00:00,2025-06-29,D,5,0,1,Migration date greater than start date.,2025-11-07 10:17:20

In [332]:
 # name of the index using loc 
df.iloc[0,8]

Timestamp('1990-01-01 07:30:00')

In [336]:
# name of the index using loc 
df.loc[0,'START_TIME']

Timestamp('1990-01-01 07:30:00')

In [324]:
df1 = df[["SCHED_DAY",'START_DATE']]
df1.head()

   SCHED_DAY START_DATE
0          1 2025-06-29
1          1 2025-06-29
2          1 2025-06-29
3          2 2025-06-29
4          2 2025-06-29

In [274]:
dic_object = { "a": ["a","b","c"],"length":[1,2,3]}
dic_object
df = pd.DataFrame(dic_object)
print(df['a'])
print(df['length'])
print(df.head())

0    a
1    b
2    c
Name: a, dtype: object
0    1
1    2
2    3
Name: length, dtype: int64
   a  length
0  a       1
1  b       2
2  c       3

In [112]:
df.iloc[0,0]

'a'

In [114]:
df.iloc[0,1]

1

In [116]:
df.iloc[1,1]

2

In [120]:
df.iloc[2,1]

3

In [430]:
songs = { "Album":['Thriller',"back in bblack","Bat out of Hell"],"Release":[1982,1980,1982],"Length":["00:42:19","00:40:00","00:20:00"]}
df = pd.DataFrame(songs)
df.head()

             Album  Release    Length
0         Thriller     1982  00:42:19
1   back in bblack     1980  00:40:00
2  Bat out of Hell     1982  00:20:00

In [438]:
df['Release']>1981

0     True
1    False
2     True
Name: Release, dtype: bool

In [494]:
df1=df[df['Release']>1981]
df1

             Album  Release    Length
0         Thriller     1982  00:42:19
2  Bat out of Hell     1982  00:20:00

In [496]:
#df1.to_csv('new_df_Release_1981.csv')
df1.to_csv('new_df_Release_1981.csv',index=False)

In [498]:
path3 = r"‪C:\Users\v099452\Coursera\Python for Data Science, AI & Development\Module 4 - Working with Data in Python\new_df_Release_1981.csv"
clean_path3 = path3.encode("ascii", "ignore").decode()
df3=pd.read_csv(clean_path3)
df3

             Album  Release    Length
0         Thriller     1982  00:42:19
1  Bat out of Hell     1982  00:20:00

In [424]:
x = df["Release"]
x = set(x)
x

{1980, 1982}

In [428]:
print(df["Release"].unique())

[1982 1980]

In [368]:
df_new = df
df_new.head()
df_new.index=["a","b","c"]
df_new

             Album  Release    Length
a         Thriller     1982  00:42:19
b   back in bblack     1980  00:40:00
c  Bat out of Hell     1982  00:20:00

In [370]:
df_new.iloc[0,0]

'Thriller'

In [382]:
df_new.loc["a","Album"]

'Thriller'

In [412]:
z=df_new.iloc[0:2,0:2]
z

            Album  Release
a        Thriller     1982
b  back in bblack     1980

In [484]:
df_new
z=df_new.loc[0:2,'Album':'Release']
z

             Album  Release    Length
a         Thriller     1982  00:42:19
b   back in bblack     1980  00:40:00
c  Bat out of Hell     1982  00:20:00

In [502]:
import pandas as pd
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [511]:
%pip install xlrd openpyxl

Requirement already satisfied: xlrd in c:\users\v099452\appdata\local\anaconda3\lib\site-packages (2.0.2)
Requirement already satisfied: openpyxl in c:\users\v099452\appdata\local\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\v099452\appdata\local\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
from pyodide.http import pyfetch
import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv"

async def download(url, filename):
    response = await pyfetch(url)
    if response.status == 200:
        with open(filename, "wb") as f:
            f.write(await response.bytes())


await download(filename, "Product-sales.csv")
df = pd.read_csv("Product-sales.csv")

ModuleNotFoundError: No module named 'pyodide'

In [3]:
import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv"

df = pd.read_csv(filename)
print(df.head())

   OrderID     Product     Category  Quantity  Price  Total   OrderDate  \
0        1      Laptop  Electronics         2    800   1600  2022-01-10
1        2  Smartphone  Electronics         3    600   1800  2022-02-15
2        3  Desk Chair    Furniture         5    150    750  2022-03-12
3        4    Notebook   Stationery        10      2     20  2022-04-05
4        5     Monitor  Electronics         1    300    300  2022-05-21

  CustomerCity
0     New York
1  Los Angeles
2      Chicago
3      Houston
4        Miami